# DataFrame Methods
---

#### In this notebook we have:
* DataFrame Methods:
    1. head()
    2. tail()
    3. info()
    4. count()
    5. describe()
    6. nunique()
* Accessing columns from DataFrame (single col : Series)
* Rearranging the col of DataFrame
---

## Brief Intro:
* DataFrame being a class it has predefined methods in it.
* These methods can only be accessed through DataFrame object.
* Methods perform operations on DataFrame and returns result.

---
## 1. head()
* Returns the first 5 records of the dataset by default.
* If we want to preview certain records of the DataFrame from start, then we can add an argument to this head() method.

In [1]:
import pandas as pd

path = "../datasets/sales1.csv"
df = pd.read_csv(path)

df.head()

   Order ID Customer Name                 Product  Quantity
0    166837         Veeru  34in Ultrawide Monitor         2
1    166838         Tarun             Samsung m10         3
2    166839         Kedar            20in Monitor         1
3    166840       Lavanya               iPhone 11         3
4    166841          Venu      Macbook Pro Laptop         2

In [2]:
df.head(10) # Returns first 10 records of the DataFrame

   Order ID Customer Name                     Product  Quantity
0    166837         Veeru      34in Ultrawide Monitor         2
1    166838         Tarun                 Samsung m10         3
2    166839         Kedar                20in Monitor         1
3    166840       Lavanya                   iPhone 11         3
4    166841          Venu          Macbook Pro Laptop         2
5    166842          Venu  Bose SoundSport Headphones         2
6    166843        Harsha      27in 4K Gaming Monitor         2
7    166844        Harsha                 Samsung m10         1
8    166845        Siddhu      34in Ultrawide Monitor         2
9    166846        Siddhu                   iPhone 11         1

---
## 2. tail()
* Similar to the head() method but returns the last 5 rows as default

In [3]:
df.tail()

     Order ID Customer Name             Product  Quantity
595    167403        Balaji  Macbook Pro Laptop         1
596    167404       Lavanya     ThinkPad Laptop         1
597    167405          Venu       Flatscreen TV         1
598    167406        Siddhu         Samsung m20         2
599    167407         Tarun  LG Washing Machine         1

In [4]:
df.tail(10)

     Order ID Customer Name                 Product  Quantity
590    167398   Mallikarjun               iPhone 7s         1
591    167399        Siddhu             Samsung m10         1
592    167400    Chaithanya  27in 4K Gaming Monitor         1
593    167401   Mallikarjun               iPhone 11         1
594    167402         Kedar             Samsung m10         1
595    167403        Balaji      Macbook Pro Laptop         1
596    167404       Lavanya         ThinkPad Laptop         1
597    167405          Venu           Flatscreen TV         1
598    167406        Siddhu             Samsung m20         2
599    167407         Tarun      LG Washing Machine         1

---
## 3. info()
This method returns below information about DataFrame,
* Type of object
* Range of object
* Number of columns
* Number of rows
* The data type of each column along with the non-null count
* Number of data types
* Total memory usage

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order ID       600 non-null    int64
 1   Customer Name  600 non-null    object
 2   Product        600 non-null    object
 3   Quantity       600 non-null    int64
dtypes: int64(2), object(2)
memory usage: 18.9+ KB

---
## 4. count()
* Returns the number of non-null values of each column

In [6]:
df.count()

Order ID         600
Customer Name    600
Product          600
Quantity         600
dtype: int64

---
## 5. describe()
* Returns the below values for only numerical datatypes:
    * count
    * mean 
    * std
    * min
    * 25%
    * 50%
    * 75%
    * max

In [7]:
df.describe()

            Order ID    Quantity
count     600.000000  600.000000
mean   167122.751667    1.481667
std       164.948568    0.683454
min    166837.000000    1.000000
25%    166980.750000    1.000000
50%    167120.500000    1.000000
75%    167266.250000    2.000000
max    167409.000000    3.000000

---
## 6. nunique() 
* Returns the number of unique values of each column of the DataFrame.

In [8]:
df.nunique()

Order ID         573
Customer Name     23
Product           21
Quantity           3
dtype: int64

In [9]:
print(df.nunique().iloc[0])

573

In [10]:
print(df.nunique()['Customer Name'])

23

---
## Accessing single column from the DataFrame
* If we try to access a single column out of the DataFrame then that returns a Series.
* If we access 2 or more columns out of the DataFrame , then that returns a DataFrame

In [11]:
# Accessing a single columns

print(type(df.Quantity))
print()
print(type(df['Quantity']))

<class 'pandas.core.series.Series'>

<class 'pandas.core.series.Series'>

In [12]:
# Accessing 2 or more columns

print(df[['Order ID', 'Quantity']])

     Order ID  Quantity
0      166837         2
1      166838         3
2      166839         1
3      166840         3
4      166841         2
..        ...       ...
595    167403         1
596    167404         1
597    167405         1
598    167406         2
599    167407         1

[600 rows x 2 columns]

---
## Rearranging columns in DataFrame

In [13]:
print(df.columns)
df = df[["Product", "Customer Name", "Quantity", "Order ID"]]
print()
print(df.columns)

Index(['Order ID', 'Customer Name', 'Product', 'Quantity'], dtype='object')

Index(['Product', 'Customer Name', 'Quantity', 'Order ID'], dtype='object')

---